guides/cursor/baselines/gotenberg_runs/k6_gotenberg_20260618_011833.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:18:34+05:30" level=info msg="gotenberg load: 48 VUs × 35s, scenario=tagged_ecdsa, skipNetworkIdle=true" source=console

running (0m01.0s), 48/48 VUs, 16 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.0s), 48/48 VUs, 36 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 55 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 69 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 90 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 106 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 124 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 134 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 152 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 170 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 185 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 200 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 212 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 228 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 246 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 259 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 279 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 295 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 300 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 318 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 334 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 350 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 369 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 389 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 399 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 408 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 427 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 448 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 462 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 476 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 497 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 500 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 515 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 529 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 544 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s

running (0m36.0s), 27/48 VUs, 565 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s

running (0m37.0s), 11/48 VUs, 581 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s

running (0m38.0s), 01/48 VUs, 591 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s
time="2026-06-18T01:19:12+05:30" level=info msg="gotenberg load done (started 2026-06-17T19:48:34.155Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<30000' p(99)=5.54s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1776    46.644129/s
    checks_succeeded...: 100.00% 1776 out of 1776
    checks_failed......: 0.00%   0 out of 1776

    ✓ status is 200
    ✓ response is pdf
    ✓ response has content

    CUSTOM
    active_latency.................: avg=2972.846154 min=564      med=2830   max=5344  p(90)=4234   p(95)=4653    p(99)=5218   
    errors.........................: 0.00% 0 out of 592
    hft_latency....................: avg=4280.5      min=3122     med=3827   max=6794  p(90)=5930.8 p(95)=6098.45 p(99)=6626.09
    pdf_generation_time............: avg=2916.768581 min=335      med=2808.5 max=6794  p(90)=4240.3 p(95)=4790.85 p(99)=5560.44
    retail_latency.................: avg=2819.072187 min=335      med=2787   max=5666  p(90)=4139   p(95)=4705    p(99)=5089.5 

    HTTP
    http_req_duration..............: avg=2.91s       min=600.18µs med=2.8s   max=6.78s p(90)=4.23s  p(95)=4.79s   p(99)=5.54s  
      { expected_response:true }...: avg=2.91s       min=600.18µs med=2.8s   max=6.78s p(90)=4.23s  p(95)=4.79s   p(99)=5.54s  
    http_req_failed................: 0.00% 0 out of 593
    http_reqs......................: 593   15.574307/s

    EXECUTION
    iteration_duration.............: avg=2.93s       min=336.32ms med=2.8s   max=7.15s p(90)=4.29s  p(95)=4.79s   p(99)=5.69s  
    iterations.....................: 592   15.548043/s
    vus............................: 1     min=1        max=48
    vus_max........................: 48    min=48       max=48

    NETWORK
    data_received..................: 27 MB 696 kB/s
    data_sent......................: 23 MB 596 kB/s



running (0m38.1s), 00/48 VUs, 592 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s